app/views/sections/list.html.erb

 <%= link_to("Add New Section",{:action => 'new'}, :class => 'action new') %>
 <div> <%= pluralize(@sections.size, 'section')%></div>
---
SELECT COUNT(*) FROM `sections`
SELECT `sections`.* FROM `sections` ORDER BY sections.position ASC

 			<td class="center"><%= status_tag(section.visible) %></td>
 			<td class="center"><%= section.section_edits.size %></td>
---
SELECT COUNT(*) FROM `section_edits` WHERE `section_edits`.`section_id` = 1