app/views/pages/list.html.erb

SELECT COUNT(*) FROM `pages`
SELECT `pages`.* FROM `pages` ORDER BY pages.position ASC
---
 <%= link_to("Add New Page",{:action => 'new', :subject_id => @subject.id}, :class => 'action new') %>
 <div> <%= pluralize(@pages.size, 'page')%></div>