app/views/subjects/list.html.erb

SELECT COUNT(*) FROM `subjects`
SELECT `subjects`.* FROM `subjects` ORDER BY subjects.position ASC
---
 <%= link_to("Add New Subject",{:action => 'new'}, :class => 'action new') %>
 <div> <%= pluralize(@subjects.size, 'subject')%></div>