app/controllers/admin_users_controller.rb

	def show
		@admin = AdminUser.find(params[:id])
---
SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 1 LIMIT 1

	def edit
		@admin = AdminUser.find(params[:id])
---
SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 1 LIMIT 1

	def update
		@admin = AdminUser.find(params[:id])
---
SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 1 LIMIT 1

	def delete
		@admin = AdminUser.find(params[:id])
---
SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 1 LIMIT 1