app/controllers/pages_controller.rb

SELECT COUNT(*) FROM `pages` WHERE `pages`.`subject_id` = 2
SELECT `pages`.* FROM `pages` WHERE `pages`.`subject_id` = 2 ORDER BY pages.position ASC
---
	def list
		@pages = Page.order("pages.position ASC").where(:subject_id => @subject.id)

SELECT COUNT(*) FROM `pages`
---
	def new
		@page = Page.new(:permalink => 'default', :subject_id => @subject.id)
		@page_count = Page.count + 1

INSERT INTO `pages` (`created_at`, `name`, `permalink`, `position`, `subject_id`, `updated_at`, `visible`) VALUES ('2012-03-18 15:29:54', 'second page', 'second', 5, NULL, '2012-03-18 15:29:54', 0)
SELECT COUNT(*) FROM `pages`
---
	def create
		@page = Page.new(params[:page])
		if @page.save
			flash[:notice] = "Page Created!"
			redirect_to(:action => 'list',:subject_id => @page.subject_id)
		else
			@page_count = Page.count + 1

SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `pages`
---
	def edit
		@page = Page.find(params[:id])
		@page_count = Page.count

SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1
UPDATE `pages` SET `position` = 4, `updated_at` = '2012-03-18 15:32:44' WHERE `pages`.`id` = 1
---
	def update
		@page = Page.find(params[:id])
		if @page.update_attributes(params[:page])

DELETE FROM `pages` WHERE `pages`.`id` = 3
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 3 LIMIT 1
---
	def destroy
		Page.find(params[:id]).destroy

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` IS NULL LIMIT 1
---
	def find_subject
		if params[:subject_id]
			@subject = Subject.find_by_id(params[:subject_id])