app/controllers/sections_controller.rb

SELECT `sections`.* FROM `sections` ORDER BY sections.position ASC
---
	def list
		@sections = Section.order("sections.position ASC")

SELECT COUNT(*) FROM `sections`
---
	def new
		@section = Section.new(:content_type => false)
		@section_count = Section.count + 1

INSERT INTO `sections` (`content`, `content_type`, `created_at`, `name`, `page_id`, `position`, `updated_at`) VALUES ('new test section I hope you like it', 0, '2012-03-18 14:33:32', 'new Test Section', NULL, 7, '2012-03-18 14:33:32')
---
	def create
		new_position = params[:section].delete(:position)

		# instantiate a new object using form parameters
		 @section = Section.new(params[:section])
		 # save the object
		 if @section.save

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `sections`
---
	def edit
		@section = Section.find(params[:id])
		@section_count = Section.count

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
UPDATE `sections` SET `content_type` = 1, `content` = 'I like to edit my sections because I\'m a loser', `updated_at` = '2012-03-18 14:33:01' WHERE `sections`.`id` = 1
---
	def update
		@section = Section.find(params[:id])
		new_position = params[:section].delete(:position)
		if @section.update_attributes(params[:section])

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 2 LIMIT 1
DELETE FROM `sections` WHERE `sections`.`id` = 2
---
	def destroy
		section = Section.find(params[:id])
		section.move_to_position(nil)
		section.destroy