app/controllers/subjects_controller.rb

SELECT `subjects`.* FROM `subjects` ORDER BY subjects.position ASC
---
	def list
		@subjects = Subject.order("subjects.position ASC")

SELECT COUNT(*) FROM `subjects`
---
	def new
		@subject = Subject.new(:name => 'default')
		@subject_count = Subject.count + 1

INSERT INTO `subjects` (`created_at`, `name`, `position`, `updated_at`, `visible`) VALUES ('2012-03-18 10:39:15', 'Test Subject', 8, '2012-03-18 10:39:15', 0)
SELECT COUNT(*) FROM `subjects`
---
	def create
		 new_position = params[:subject].delete(:position)
		 # instantiate a new object using form parameters
		 @subject = Subject.new(params[:subject])
		 # save the object
		 if @subject.save
		 	@subject.move_to_position(new_position)
		 	# if save succeeds, redirect to the list action
		 	flash[:notice] = "Subject Created!"
		 	redirect_to(:action => 'list')
		 else
		 	# if save fails, redisplay the form so user can fix problmes
		 	@subject_count = Subject.count +  1

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 4 LIMIT 1
UPDATE `subjects` SET `position` = 7, `updated_at` = '2012-03-18 10:53:39' WHERE `subjects`.`id` = 4
SELECT COUNT(*) FROM `subjects`
---
	def update
		# find object from parameters
		@subject = Subject.find(params[:id])
		new_position = params[:subject].delete(:position)

		# update the object
		if @subject.update_attributes(params[:subject])
			@subject.move_to_position(new_position)

			# if update succeeds. redirect to list action
			flash[:notice] = "Subject Updated!"
			redirect_to(:action => 'show', :id => @subject.id)
		else
			# fi update fails, redisplay the form so user can fix problems
			@subject_count = Subject.count

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 4 LIMIT 1
DELETE FROM `subjects` WHERE `subjects`.`id` = 4
---
	def destroy
		# find object from params and destroy
		subject = Subject.find(params[:id])
		subject.move_to_position(nil)
		subject.destroy